In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('./nifty50.csv')
df[0:2000]
df.head()

   index      date   time     open     high      low    close
0  NIFTY  20130401  09:16  5701.15  5704.65  5694.30  5697.00
1  NIFTY  20130401  09:17  5697.05  5698.35  5695.65  5697.50
2  NIFTY  20130401  09:18  5697.90  5697.90  5690.60  5692.15
3  NIFTY  20130401  09:19  5691.65  5694.70  5691.65  5693.90
4  NIFTY  20130401  09:20  5694.40  5695.05  5693.35  5694.55

In [3]:
df['open'].describe()

count    352920.000000
mean       7374.515649
std        1070.893139
min        5126.150000
25%        6167.650000
50%        7738.800000
75%        8298.762500
max        9115.400000
Name: open, dtype: float64

In [4]:
df['high'].describe()

count    352920.000000
mean       7376.077510
std        1071.032665
min        5127.250000
25%        6168.900000
50%        7740.150000
75%        8300.900000
max        9119.200000
Name: high, dtype: float64

In [5]:
df1=pd.to_datetime(df['date'],format='%Y%m%d')
df2=pd.DataFrame(list(df1),columns=['date1'])
df2.head()

       date1
0 2013-04-01
1 2013-04-01
2 2013-04-01
3 2013-04-01
4 2013-04-01

In [6]:
from datetime import datetime
l1=[]
for x in df['time']:
    d = datetime.strptime(x, "%H:%M")
    l1.append(d.strftime("%I:%M %p"))
    
    
df3=pd.DataFrame(l1,columns=['time1']) 
df4=pd.concat([df2,df3],axis=1)

In [19]:
df5=pd.concat([df.drop(['date','time','index'],axis=1),df4],axis=1)
#df5.drop(['date'],axis=1)
#df5.head()
df5.head()

      open     high      low    close      date1     time1
0  5701.15  5704.65  5694.30  5697.00 2013-04-01  09:16 AM
1  5697.05  5698.35  5695.65  5697.50 2013-04-01  09:17 AM
2  5697.90  5697.90  5690.60  5692.15 2013-04-01  09:18 AM
3  5691.65  5694.70  5691.65  5693.90 2013-04-01  09:19 AM
4  5694.40  5695.05  5693.35  5694.55 2013-04-01  09:20 AM

In [32]:
df6 = df5[(df5['date1']>= "2013-04-01") & (df5['date1']<="2013-04-01")]
df6.head()

      open     high      low    close      date1     time1
0  5701.15  5704.65  5694.30  5697.00 2013-04-01  09:16 AM
1  5697.05  5698.35  5695.65  5697.50 2013-04-01  09:17 AM
2  5697.90  5697.90  5690.60  5692.15 2013-04-01  09:18 AM
3  5691.65  5694.70  5691.65  5693.90 2013-04-01  09:19 AM
4  5694.40  5695.05  5693.35  5694.55 2013-04-01  09:20 AM

In [33]:
df6.shape

(375, 6)

In [34]:
df6.describe()

              open         high          low        close
count   375.000000   375.000000   375.000000   375.000000
mean   5699.156667  5700.197600  5698.066533  5699.125067
std       8.892726     8.905189     8.874712     8.926377
min    5676.150000  5676.950000  5675.900000  5676.100000
25%    5693.100000  5694.125000  5691.800000  5692.900000
50%    5699.250000  5700.200000  5698.150000  5699.350000
75%    5706.025000  5707.575000  5705.000000  5706.075000
max    5720.800000  5720.950000  5719.150000  5720.600000

In [154]:
import json
def date_result(date):
    main_result=[]
    weight=0
    for x in range(int(date[0])):
        date='2013-04-0{a}'.format(a=x+1)
        df6 = df5[(df5['date1']>= date) & (df5['date1']<=date)]
        result={"date":date+' '+df6['time1'][weight],"open":df6['open'].max(),
                "high":df6['high'].max(),
                "low":df6['low'].min(),"close":df6['close'].min()}
        
        main_result.append(result)
        weight+=len(df6)
    return json.dumps(main_result)

In [156]:
date_result('5d')

1875

'[{"date": "2013-04-01 09:16 AM", "open": 5720.8, "high": 5720.95, "low": 5675.9, "close": 5676.1}, {"date": "2013-04-02 09:16 AM", "open": 5754.3, "high": 5754.6, "low": 5687.15, "close": 5687.95}, {"date": "2013-04-03 09:16 AM", "open": 5743.8, "high": 5744.95, "low": 5650.1, "close": 5651.9}, {"date": "2013-04-04 09:16 AM", "open": 5642.2, "high": 5644.45, "low": 5565.65, "close": 5568.65}, {"date": "2013-04-05 09:16 AM", "open": 5575.75, "high": 5577.3, "low": 5534.7, "close": 5535.15}]'